blogs/encounter-hacking.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-29 一 11:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>腾讯云主机遭遇黑客入侵</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">腾讯云主机遭遇黑客入侵</h1>
<p>
先是收到腾讯云安全报警，“服务器疑似被黑客入侵”并提示了木马文件的位置。本文记录处理过程：
</p>

<div id="outline-container-org1d92ffa" class="outline-2">
<h2 id="org1d92ffa"><span class="section-number-2">1</span> 大招</h2>
<div class="outline-text-2" id="text-1">
<p>
如果数据可以从其它地方恢复，并且重新部署很容易，建议直接重装系统。
</p>
</div>
</div>

<div id="outline-container-org4b6a248" class="outline-2">
<h2 id="org4b6a248"><span class="section-number-2">2</span> 加强sshd安全性</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>sshd禁用密码登陆</li>
<li>排查所有用户的 <code>authorized_keys</code> 文件，看看有没有异常的key</li>
</ul>
</div>
</div>

<div id="outline-container-org8b400c3" class="outline-2">
<h2 id="org8b400c3"><span class="section-number-2">3</span> 检查端口安全策略</h2>
<div class="outline-text-2" id="text-3">
<p>
检查腾讯云的安全策略，看看是不是只开放了80和22端口。也可以先手动配置iptables。
</p>
<div class="org-src-container">
<pre class="src src-bash">iptables -A INPUT -p tcp --dport 22 -j ACCEPT
iptables -A INPUT -p tcp --dport 80 -j ACCEPT
iptables -A INPUT -p tcp --syn -j DROP
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe833e8" class="outline-2">
<h2 id="orgbe833e8"><span class="section-number-2">4</span> 重新记录系统日志</h2>
<div class="outline-text-2" id="text-4">
<p>
入侵者通常会删除 <code>/var/log</code> 下的重要日志，并关闭 <code>syslog</code>
</p>
<div class="org-src-container">
<pre class="src src-bash">
<span style="color: #ffff00;"># </span><span style="color: #ffff00;">&#21551;&#21160;syslog</span>
/etc/init.d/rsyslog start

<span style="color: #ffff00;"># </span><span style="color: #ffff00;">&#21551;&#21160;&#35775;&#38382;&#35760;&#24405;</span>
touch /var/log/wtmp
chown root:utmp /var/log/wtmp
chmod 0664 /var/log/wtmp

</pre>
</div>
</div>
</div>

<div id="outline-container-orgb523e34" class="outline-2">
<h2 id="orgb523e34"><span class="section-number-2">5</span> 检查可疑进程</h2>
<div class="outline-text-2" id="text-5">
<p>
先用 <code>netstat -tnlp</code> 检查可疑端口，kill掉相关进程。然后 <code>ps -ef</code> 检查可疑的进程，发现之后，顺便检查下父子进程。
这里kill进程时用 <code>kill -9</code>
</p>
</div>
</div>

<div id="outline-container-orgb45beb9" class="outline-2">
<h2 id="orgb45beb9"><span class="section-number-2">6</span> 检查可疑cron</h2>
<div class="outline-text-2" id="text-6">
<p>
利用cron，入侵者可以定时启动自己。检查 <code>/etc/crontab</code> <code>/etc/cron.d*</code> <code>/var/spool/cron</code> <code>/var/spool/cron/crontabs</code> 这些路径。并通过 <code>/var/log/cron</code> 查看有没有可疑的cron执行。
</p>
</div>
</div>

<div id="outline-container-orgdb6b263" class="outline-2">
<h2 id="orgdb6b263"><span class="section-number-2">7</span> 检查重要daemon进程</h2>
<div class="outline-text-2" id="text-7">
<p>
检查 <code>crond</code> <code>sshd</code> 等具有root权限的daemon，以防他们被入侵者替换掉了，假装成正经进程的木马文件最可怕。
</p>
</div>
</div>

<div id="outline-container-org47110b1" class="outline-2">
<h2 id="org47110b1"><span class="section-number-2">8</span> 删除木马文件</h2>
<div class="outline-text-2" id="text-8">
<p>
在排查可疑进程，可疑cron时发现的文件，立即删除掉。隔段时间再检查下，以免有遗漏的进程或cron没被清理干净。
</p>
</div>
</div>

<div id="outline-container-org4f91e13" class="outline-2">
<h2 id="org4f91e13"><span class="section-number-2">9</span> 预防最重要</h2>
<div class="outline-text-2" id="text-9">
<p>
预防比治疗简单的多得多，不要心存侥幸。
</p>

<ul class="org-ul">
<li>检查云主机的安全策略，只放开必要端口，开放端口的进程尽量别用ROOT运行</li>
<li>禁用密码登陆</li>
<li>备份重要数据，并作为常规流程</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2019-04-29 一 11:37</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
